exercises/exercise_04_eigenschaften_regulaerer_kf_Sprachen.tex
% Created 2025-12-31 Mi 14:02
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\author{Elias}
\date{\today}
\title{Übungsblatt 4}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Übungsblatt 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Übung 4}}
\label{sec:orgdde6126}
\subsection{\textbf{Eigenschaften regulärer bzw. kontextfreier Sprachen, Chomsky-Normalform und CYK-Algorithmus}}
\label{sec:org1723bd6}

Hinweis: Zur Lösung der Aufgaben 1 bis 5 dieser Serie greifen Sie auf
das Pumping-Lemma bzw. die Abschlusseigenschaften der jeweiligen
Sprachklasse zurück.
\subsubsection{\textbf{Aufgabe 1}}
\label{sec:org503ec37}

Zeigen Sie, dass die Sprache \(L= \{scs \mid s \in \{a, b\}^* \}\) nicht
regulär ist.
\subsubsection{\textbf{Aufgabe 2}}
\label{sec:org7960b9e}

Zeigen Sie, dass die Sprache \(L= \{scs \mid s \in \{a, b\}^* \}\) nicht
kontextfrei ist.
\subsubsection{\textbf{Aufgabe 3}}
\label{sec:orga99f31f}

\(L\) sei regulär und werde durch einen DFA mit 4 Zuständen akzeptiert.
\(L\) enthalte ein Wort der Länge 4. Ist \(L\) unendlich? Begründen Sie
die Antwort.
\subsubsection{\textbf{Aufgabe 4}}
\label{sec:org5fb9a1d}

Seien \(L_1, L_2 \subseteq \Sigma^*\) zwei Sprachen. \(L_1\) und
\(L=L_1 \cup L_2\) seien regulär.

Es gelte \(L_1 \cap L_2 = \varnothing\). Beweisen Sie: \(L_2\) ist
regulär.
\subsubsection{\textbf{Aufgabe 5}}
\label{sec:orge66526e}

Zeigen Sie: die folgende Sprache ist nicht kontextfrei:
\[L=\{w \in \{a, b, c\}^* \mid |w|_a=|w|_b=|w|_c\}\] Dabei bezeichnet
\(|w|_a\) die Anzahl von \(a\)'s im Wort \(w\).
\subsubsection{\textbf{Aufgabe 6}}
\label{sec:org0cbbd44}

Gegeben sei \[G=(\{S,A,B\},\{a,b,c\},P,S)\] mit der Produktionsmenge
\(P\): \\

\[\begin{aligned}
        S \rightarrow & aAb \mid aBb\\
        A \rightarrow & S \mid aaSc \mid B \mid \varepsilon\\
\end{aligned}\]

Überführen Sie diese Grammatik in Chomsky-Normalform.
\subsubsection{\textbf{Aufgabe 7}}
\label{sec:org2d31cfa}

Gegeben sei folgende Grammatik \(G\) in Chomsky-Normalform: \\

\[\begin{aligned}
        S \rightarrow & AB\\
        A \rightarrow & X_aX_b \mid X_aC\\
        C \rightarrow & AX_a\\
        B \rightarrow & c \mid X_cB\\
        X_a \rightarrow & a\\
        X_b \rightarrow & b\\
        X_c \rightarrow & c\\
\end{aligned}\]

Prüfen Sie mittels CYK-Algorithmus, ob das Wort \(aabacc\) in \(L(G)\) enthalten ist.
\end{document}
